Revit 2024 API
StructuralSectionGeneralH.OuterFillet Property
 Outer Fillet - Corner fillet outer radius.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double OuterFillet { get; set; }
Visual Basic
Public Property OuterFillet As Double
	Get
	Set
Visual C++
public:
property double OuterFillet {
	double get ();
	void set (double value);
}
See Also
StructuralSectionGeneralH Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace